---
kind: method
id: M:Autodesk.Revit.DB.FamilyManager.MakeType(Autodesk.Revit.DB.FamilyParameter)
source: html/96f7f8e3-b500-b220-6f08-388b63a0e543.htm
---
# Autodesk.Revit.DB.FamilyManager.MakeType Method

Set the family parameter as a type parameter.

## Syntax (C#)
```csharp
public void MakeType(
	FamilyParameter familyParameter
)
```

## Parameters
- **familyParameter** (`Autodesk.Revit.DB.FamilyParameter`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - Thrown when the input argument-"familyParameter"-is Nothing nullptr a null reference ( Nothing in Visual Basic) .
- **Autodesk.Revit.Exceptions.ArgumentException** - Thrown when the input argument-"familyParameter"-is an invalid parameter or a builtIn parameter.